performance/raquetelio/artilleryRaceRegistration.yml
config:
  target: "http://192.168.49.2:32121"
  phases:
    - duration: 30
      arrivalRate: 1000
      maxVusers: 30000
      name: Massive load
  http:
    timeout: 80

  payload:

    path: "../../db/export_test_data_20221118/application_code_202211181836.csv"   
    fields:
        - "applicationCode"
    order: sequence
    skipHeader: true

scenarios:
  - name: "Register in Race by Order"
    flow:
      - post:
          url: "/api/tracks/byorder"
          json:
            applicationCode: "{{ applicationCode }}"