performance/raquetelio/artilleryRaceRegistration.yml
config:
  target: "http://192.168.49.2:31107"
  phases:
    - duration: 30
      arrivalRate: 1    
      maxVusers: 30  
      name: Warm up

    - duration: 40
      arrivalRate: 500
      maxVusers: 40000
      name: Massive load

 #   - duration: 30
 #     arrivalRate: 10     
 #     name: Load down  

  http:
    timeout: 80

  payload:

    path: "application_202211082353_postgres.csv"   
    fields:
        - "applicationCode"
    order: sequence
    skipHeader: true

scenarios:
  - name: "Register in Race by Order"
    flow:
      - post:
          url: "/api/tracks/byorder"
          json:
            applicationCode: "{{ applicationCode }}"
     #     capture:
     #       - json: "$.results.id"
     #         as: "trackId"